# Rebar Free Form Aligned Server Guid Property

Source: https://www.revitapidocs.com/2026/06350533-20fb-11c3-6636-45add35364fe.htm

---

| Rebar Free Form Aligned Server Guid Property |
| --- |

Guid used for identifying the external IRebarUpdateServer for computing Aligned Free Form Rebar.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static Guid FreeFormAlignedServerGuid { get; }
```

```
Public Shared ReadOnly Property FreeFormAlignedServerGuid As Guid
	Get
```

```
public:
static property Guid FreeFormAlignedServerGuid {
	Guid get ();
}
```

```
static member FreeFormAlignedServerGuid : Guid with get
```

#### Property Value

Guid See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace